app/controllers/application_controller.rb

SELECT 1 AS one FROM "jwt_denylist" WHERE "jwt_denylist"."jti" = ? LIMIT ?  [["jti", "dda75ad5-c2ae-4c7b-a799-68af04ed084c"], ["LIMIT", 1]]
---
  def decoded_token
    header = request.headers['Authorization']
    return nil if header.nil?

    token = header.split(' ').last if header
    begin
      decoded = JWT.decode(token, Rails.application.credentials.secret_key_base, true)[0]
      return nil if JwtDenylist.exists?(jti: decoded['jti'])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    return nil unless decoded_token

    user_id = decoded_token['user_id']
    @user = User.find_by(id: user_id)